src/testsuite/sysbench/results/oltp_update_index.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 694.78 qps: 694.78 (r/w/o: 0.00/694.78/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 562.40 qps: 562.40 (r/w/o: 0.00/562.40/0.00) lat (ms,95%): 511.33 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 466.45 qps: 466.45 (r/w/o: 0.00/466.45/0.00) lat (ms,95%): 580.02 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           35093
        other:                           0
        total:                           35093
    transactions:                        35093  (584.12 per sec.)
    queries:                             35093  (584.12 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      584.1193
    time elapsed:                        60.0799s
    total number of events:              35093

Latency (ms):
         min:                                   41.57
         avg:                                  219.64
         max:                                 1435.39
         95th percentile:                      484.44
         sum:                              7707946.04

Threads fairness:
    events (avg/stddev):           274.1641/2.68
    execution time (avg/stddev):   60.2183/0.02

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 577.03 qps: 577.03 (r/w/o: 0.00/577.03/0.00) lat (ms,95%): 559.50 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 959.25 qps: 959.25 (r/w/o: 0.00/959.25/0.00) lat (ms,95%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 1184.55 qps: 1184.55 (r/w/o: 0.00/1184.55/0.00) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           53901
        other:                           0
        total:                           53901
    transactions:                        53901  (894.17 per sec.)
    queries:                             53901  (894.17 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      894.1696
    time elapsed:                        60.2819s
    total number of events:              53901

Latency (ms):
         min:                                   33.36
         avg:                                  143.11
         max:                                 2225.75
         95th percentile:                      272.27
         sum:                              7713788.14

Threads fairness:
    events (avg/stddev):           421.1016/4.19
    execution time (avg/stddev):   60.2640/0.03